Revit 2024 API
NestedFamilyTypeReference Class
 A proxy element representing a nested family type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class NestedFamilyTypeReference : Element
Visual Basic
Public Class NestedFamilyTypeReference _
	Inherits Element
Visual C++
public ref class NestedFamilyTypeReference : public Element
Remarks
This element represents a value of a FamilyType Parameter of a Loaded Family. Each such element corresponds to a nested FamilyType Element in the original Family Document where the family was defined.
This element stores only basic information about the nested FamilyType, such as the name of the Type, name of the Family, and a Category.
These elements are very low-level and thus bypassed by standard element filters. However, it is possible to obtain a set of applicable elements of this class for a FamilyType parameter of a family by calling [!:Autodesk::Revit::DB::Family::GetFamilyTypeParameterValues]
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.NestedFamilyTypeReference
See Also
NestedFamilyTypeReference Members
Autodesk.Revit.DB Namespace